# IsFromLocalPath Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RevitLinkType..::..IsFromLocalPath Method
RevitLinkType Class See Also
---
Checks whether the Revit link uses a local path, such as a hard drive.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public bool IsFromLocalPath()
```

Visual Basic
---
```text
Public Function IsFromLocalPath As Boolean
```

Visual C++
---
```text
public:
bool IsFromLocalPath()
```

# ### Return Value
Returns true if the Revit link is from a local drive.
# See Also
RevitLinkType Class
Autodesk.Revit.DB Namespace